app/controllers/teachers_controller.rb

    def index
        @teacher = Teacher.all
---
SELECT "teachers".* FROM "teachers"